monitoring/check/before/main_load.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./check/main_load.js
     output: -

  scenarios: (100.00%) 1 scenario, 184 max VUs, 6m40s max duration (incl. graceful stop):
           * default: Up to 184 looping VUs for 6m10s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)
å
     ✓ response ok

     checks.........................: 100.00% ✓ 34913 ✗ 0    
     data_received..................: 55 MB   148 kB/s
     data_sent......................: 13 MB   34 kB/s
     http_req_blocked...............: avg=71.57µs  min=0s     med=0s      max=1.05s    p(90)=1µs     p(95)=1µs    
     http_req_connecting............: avg=31.21µs  min=0s     med=0s      max=1.01s    p(90)=0s      p(95)=0s     
   ✓ http_req_duration..............: avg=22.55ms  min=4.56ms med=11.19ms max=468.72ms p(90)=44.3ms  p(95)=84.41ms
       { expected_response:true }...: avg=22.55ms  min=4.56ms med=11.19ms max=468.72ms p(90)=44.3ms  p(95)=84.41ms
     http_req_failed................: 0.00%   ✓ 0     ✗ 69826
     http_req_receiving.............: avg=280.59µs min=28µs   med=80µs    max=221.06ms p(90)=351µs   p(95)=869µs  
     http_req_sending...............: avg=97.66µs  min=19µs   med=78µs    max=12.26ms  p(90)=176µs   p(95)=227µs  
     http_req_tls_handshaking.......: avg=39.35µs  min=0s     med=0s      max=215.04ms p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=22.17ms  min=1.97ms med=10.88ms max=467.16ms p(90)=43.17ms p(95)=83.76ms
     http_reqs......................: 69826   188.269554/s
     iteration_duration.............: avg=1.04s    min=1.01s  med=1.02s   max=2.09s    p(90)=1.08s   p(95)=1.17s  
     iterations.....................: 34913   94.134777/s
     vus............................: 9       min=1   max=184
     vus_max........................: 184     min=184 max=184