monitoring/check/before/main_smoke.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./check/main_smoke.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
           * default: 1 looping VUs for 1m0s (gracefulStop: 30s)

     ✓ response ok

     checks.........................: 100.00% ✓ 58  ✗ 0  
     data_received..................: 95 kB   1.6 kB/s
     data_sent......................: 21 kB   349 B/s
     http_req_blocked...............: avg=1.6ms    min=0s     med=500ns    max=185.74ms p(90)=1µs     p(95)=1µs     
     http_req_connecting............: avg=38.62µs  min=0s     med=0s       max=4.48ms   p(90)=0s      p(95)=0s      
   ✓ http_req_duration..............: avg=23.86ms  min=5.12ms med=22.27ms  max=70.38ms  p(90)=42.79ms p(95)=46.04ms 
       { expected_response:true }...: avg=23.86ms  min=5.12ms med=22.27ms  max=70.38ms  p(90)=42.79ms p(95)=46.04ms 
     http_req_failed................: 0.00%   ✓ 0   ✗ 116
     http_req_receiving.............: avg=145.59µs min=49µs   med=116.49µs max=1.03ms   p(90)=213µs   p(95)=316.75µs
     http_req_sending...............: avg=169.01µs min=33µs   med=148.5µs  max=530µs    p(90)=342.5µs p(95)=375.5µs 
     http_req_tls_handshaking.......: avg=1.55ms   min=0s     med=0s       max=179.97ms p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=23.55ms  min=4.92ms med=22.03ms  max=69.8ms   p(90)=42.39ms p(95)=45.59ms 
     http_reqs......................: 116     1.900826/s
     iteration_duration.............: avg=1.05s    min=1.04s  med=1.04s    max=1.22s    p(90)=1.05s   p(95)=1.06s   
     iterations.....................: 58      0.950413/s
     vus............................: 1       min=1 max=1
     vus_max........................: 1       min=1 max=1